package com.mtvs.todolist.global;

public enum Message {
    START_MENU("""
                ██╗    ████████╗ ██████╗ ██████╗  ██████╗ ██╗     ██╗███████╗████████╗  ██╗
                ██║    ╚══██╔══╝██╔═══██╗██╔══██╗██╔═══██╗██║     ██║██╔════╝╚══██╔══╝  ██║
                ██║       ██║   ██║   ██║██║  ██║██║   ██║██║     ██║███████╗   ██║     ██║
                ╚═╝       ██║   ██║   ██║██║  ██║██║   ██║██║     ██║╚════██║   ██║     ╚═╝
                ██╗       ██║   ╚██████╔╝██████╔╝╚██████╔╝███████╗██║███████║   ██║     ██╗
                ╚═╝       ╚═╝    ╚═════╝ ╚═════╝  ╚═════╝ ╚══════╝╚═╝╚══════╝   ╚═╝     ╚═╝
                ==== 메뉴 선택 ====
                   1. 회원가입
                   2. 로그인
                   3. 종료
                =================
    """),
    END_MENU("🚀 프로그램을 종료합니다."),
    INVALID_MENU("❌ 잘못된 입력입니다. 다시 선택하세요.");


    private final String message;

    Message(final String message) {
        this.message = message;
    }

    public String getMessage() {
        return this.message;
    }
}
